sandbox/get_generic_data_2.1.xml

<?xml version="1.0" encoding="UTF-8" ?>
    <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
      xmlns:web="http://www.sdmx.org/resources/sdmxml/schemas/v2_1/webservices"
      xmlns:mes="http://www.sdmx.org/resources/sdmxml/schemas/v2_1/message"
      xmlns:com="http://www.sdmx.org/resources/sdmxml/schemas/v2_1/common"
      xmlns:quer="http://www.sdmx.org/resources/sdmxml/schemas/v2_1/query">
      <soapenv:Header/>
      <soapenv:Body>
        <web:GetGenericData>
          <mes:GenericDataQuery>
            <mes:Header>
              <mes:ID>ID0</mes:ID>
              <mes:Test>false</mes:Test>
              <mes:Prepared>2006-05-04T18:13:51.0Z</mes:Prepared>
              <mes:Sender id="id0"/>
              <mes:Receiver id="id1"/>
            </mes:Header>
            <mes:Query>
              <quer:ReturnDetails/>
              <quer:DataWhere>
                <quer:Dataflow>
                  <Ref agencyID="ESTAT" id="bop_euins_q"/>
                </quer:Dataflow>
                <quer:DimensionValue>
                  <quer:ID>POST</quer:ID>
                  <quer:Value>100</quer:Value>
                </quer:DimensionValue>
                <quer:DimensionValue>
                  <quer:ID>PARTNER</quer:ID>
                  <quer:Value>EUR</quer:Value>
                </quer:DimensionValue>
                <quer:DimensionValue>
                  <quer:ID>FREQ</quer:ID>
                  <quer:Value>Q</quer:Value>
                </quer:DimensionValue>
                <quer:DimensionValue>
                  <quer:ID>GEO</quer:ID>
                  <quer:Value>COMM</quer:Value>
                </quer:DimensionValue>
                <quer:TimeDimensionValue>
                  <quer:ID>TIME_PERIOD</quer:ID>
                  <quer:TimeValue operator="greaterThanOrEqual"
                    >2010-01</quer:TimeValue>
                </quer:TimeDimensionValue>
              </quer:DataWhere>
            </mes:Query>
          </mes:GenericDataQuery>
        </web:GetGenericData>
      </soapenv:Body>
    </soapenv:Envelope>  
